Repository: drhdev/genart-featured-images
Catalog: languages/genart-featured-images-*.po
Languages: de_de, es_es, fr_fr, it_it, pt_br

source: Settings
de_de: Einstellungen
es_es: Ajustes
fr_fr: Réglages
it_it: Impostazioni
pt_br: Configurações

source: Invalid settings payload received.
de_de: Ungültige Einstellungsdaten empfangen.
es_es: Se recibió una carga de ajustes no válida.
fr_fr: Charge utile de réglages invalide reçue.
it_it: Ricevuto payload impostazioni non valido.
pt_br: Carga de configurações inválida recebida.

source: Analyzing resources and pending posts...
de_de: Ressourcen und ausstehende Beiträge werden analysiert...
es_es: Analizando recursos y entradas pendientes...
fr_fr: Analyse des ressources et des articles en attente...
it_it: Analisi delle risorse e degli articoli in attesa...
pt_br: Analisando recursos e posts pendentes...

source: Generating featured images...
de_de: Beitragsbilder werden generiert...
es_es: Generando imágenes destacadas...
fr_fr: Génération des images mises en avant...
it_it: Generazione delle immagini in evidenza...
pt_br: Gerando imagens destacadas...

source: Bulk generation completed successfully.
de_de: Die Stapelgenerierung wurde erfolgreich abgeschlossen.
es_es: La generación por lotes se completó correctamente.
fr_fr: La génération en lot s'est terminée avec succès.
it_it: La generazione in blocco è stata completata con successo.
pt_br: A geração em lote foi concluída com sucesso.

source: Request failed. Please refresh and try again.
de_de: Die Anfrage ist fehlgeschlagen. Bitte Seite neu laden und erneut versuchen.
es_es: La solicitud falló. Actualiza la página e inténtalo de nuevo.
fr_fr: La requête a échoué. Veuillez actualiser et réessayer.
it_it: Richiesta non riuscita. Aggiorna la pagina e riprova.
pt_br: A solicitação falhou. Atualize a página e tente novamente.

source: Generating featured image...
it_it: Generazione immagine in evidenza...

source: Featured image generated.
it_it: Immagine in evidenza generata.

source: Image generation failed.
it_it: Generazione immagine non riuscita.

source: Please save the post once before generating a featured image.
it_it: Salva il contenuto almeno una volta prima di generare un'immagine in evidenza.

source: Generate Featured Image Now
it_it: Genera immagine in evidenza ora

source: Generate Featured Image
it_it: Genera immagine in evidenza

source: Create a new generated featured image for this post.
it_it: Crea una nuova immagine in evidenza generata per questo articolo.

source: 1) Default Image Design
it_it: 1) Design immagine predefinito

source: Algorithm
de_de: Algorithmus
es_es: Algoritmo
fr_fr: Algorithme
it_it: Algoritmo
pt_br: Algoritmo

source: Mesh gradient
de_de: Mesh-Verlauf
es_es: Degradado de malla
fr_fr: Dégradé maillé
it_it: Gradiente mesh
pt_br: Gradiente em malha

source: Bauhaus shapes
de_de: Bauhaus-Formen
es_es: Formas Bauhaus
fr_fr: Formes Bauhaus
it_it: Forme Bauhaus
pt_br: Formas Bauhaus

source: Digital stream
de_de: Digitaler Strom
es_es: Flujo digital
fr_fr: Flux numérique
it_it: Flusso digitale
pt_br: Fluxo digital

source: Defines the visual style of the generated featured image.
it_it: Definisce lo stile visivo dell'immagine in evidenza generata.

source: Palette
es_es: Paleta
it_it: Tavolozza
pt_br: Paleta

source: Choose a predefined color palette for generated images.
de_de: Wählen Sie eine vordefinierte Farbpalette für generierte Bilder.
es_es: Elige una paleta de colores predefinida para las imágenes generadas.
fr_fr: Choisissez une palette de couleurs prédéfinie pour les images générées.
it_it: Scegli una tavolozza di colori predefinita per le immagini generate.
pt_br: Escolha uma paleta de cores predefinida para as imagens geradas.

source: Custom hex colors
de_de: Benutzerdefinierte HEX-Farben
es_es: Colores HEX personalizados
fr_fr: Couleurs HEX personnalisées
it_it: Colori HEX personalizzati
pt_br: Cores HEX personalizadas

source: WebP quality
it_it: Qualità WebP

source: Compression quality from 10 (smallest) to 100 (best quality).
it_it: Qualità di compressione da 10 (più piccolo) a 100 (qualità migliore).

source: 2) SEO Metadata Defaults
it_it: 2) Predefiniti metadati SEO

source: ALT and title template
de_de: ALT- und Titelvorlage
es_es: Plantilla de ALT y título
fr_fr: Modèle ALT et titre
it_it: Template ALT e titolo
pt_br: Modelo de ALT e título

source: Available placeholders: %title% (post title), %sitename% (site title).
de_de: Verfügbare Platzhalter: %title% (Beitragstitel), %sitename% (Website-Titel).
es_es: Marcadores disponibles: %title% (título de la entrada), %sitename% (título del sitio).
fr_fr: Variables disponibles : %title% (titre de l'article), %sitename% (titre du site).
it_it: Segnaposto disponibili: %title% (titolo articolo), %sitename% (titolo sito).
pt_br: Marcadores disponíveis: %title% (título do post), %sitename% (nome do site).

source: 3) Editor and Save Behavior
it_it: 3) Comportamento editor e salvataggio

source: Auto-generate on post save
it_it: Generazione automatica al salvataggio

source: If a post has no featured image on save, create one automatically.
it_it: Se un articolo non ha un'immagine in evidenza al salvataggio, creane una automaticamente.

source: Manual generate button in post editor
it_it: Pulsante manuale nell'editor

source: Show a “Generate Featured Image Now” button in the post sidebar.
it_it: Mostra un pulsante “Genera immagine in evidenza ora” nella barra laterale dell'editor.

source: Manual button overwrite behavior
it_it: Comportamento sovrascrittura pulsante manuale

source: 4) Bulk Generation
it_it: 4) Generazione in blocco

source: Generate featured images for existing posts without thumbnails.
de_de: Generiert Beitragsbilder für bestehende Beiträge ohne Beitragsbild.
es_es: Genera imágenes destacadas para entradas existentes sin miniatura.
fr_fr: Générez des images mises en avant pour les articles existants sans image à la une.
it_it: Genera immagini in evidenza per articoli esistenti senza miniatura.
pt_br: Gere imagens destacadas para posts existentes sem imagem destacada.

source: Run Dry Run
de_de: Trockenlauf ausführen
es_es: Ejecutar simulación
fr_fr: Lancer la simulation
it_it: Esegui simulazione
pt_br: Executar simulação

source: Start Bulk Generation
de_de: Stapelgenerierung starten
es_es: Iniciar generación por lotes
fr_fr: Démarrer la génération en lot
it_it: Avvia generazione in blocco
pt_br: Iniciar geração em lote

source: Save Settings
de_de: Einstellungen speichern
es_es: Guardar ajustes
fr_fr: Enregistrer les réglages
it_it: Salva impostazioni
pt_br: Salvar configurações

source: Insufficient permissions.
de_de: Unzureichende Berechtigungen.
es_es: Permisos insuficientes.
fr_fr: Permissions insuffisantes.
it_it: Permessi insufficienti.
pt_br: Permissões insuficientes.

source: GD with WebP support is required to generate images.
de_de: Für die Bilderzeugung ist GD mit WebP-Unterstützung erforderlich.
es_es: Se requiere GD con soporte WebP para generar imágenes.
fr_fr: GD avec prise en charge WebP est requis pour générer des images.
it_it: Per generare immagini è richiesto GD con supporto WebP.
pt_br: GD com suporte a WebP é necessário para gerar imagens.

source: Batch level:
de_de: Stapelstufe:
es_es: Nivel de lote:
fr_fr: Niveau de lot :
it_it: Livello batch:
pt_br: Nível do lote:

source: Posts pending image generation:
de_de: Beiträge mit ausstehender Bilderzeugung:
es_es: Entradas pendientes de generación de imagen:
fr_fr: Articles en attente de génération d'image :
it_it: Articoli in attesa di generazione immagine:
pt_br: Posts com geração de imagem pendente:

source: %d posts remaining.
de_de: Noch %d Beiträge übrig.
es_es: Quedan %d entradas.
fr_fr: Il reste %d articles.
it_it: Restano %d articoli.
pt_br: Restam %d posts.

source: Invalid post.
it_it: Articolo non valido.

source: Image generation failed due to a runtime error on the server.
it_it: La generazione dell'immagine non è riuscita a causa di un errore di runtime sul server.

source: Safe
de_de: Sicher
es_es: Seguro
fr_fr: Sûr
it_it: Sicuro
pt_br: Seguro

source: Balanced
de_de: Ausgewogen
es_es: Equilibrado
fr_fr: Équilibré
it_it: Bilanciato
pt_br: Equilibrado

source: Performance
de_de: Leistung
es_es: Rendimiento
it_it: Prestazioni
pt_br: Desempenho

source: Unable to initialize image canvas.
de_de: Bildfläche konnte nicht initialisiert werden.
es_es: No se pudo inicializar el lienzo de imagen.
fr_fr: Impossible d'initialiser le canevas d'image.
it_it: Impossibile inizializzare il canvas immagine.
pt_br: Não foi possível inicializar a tela da imagem.

source: No valid colors available for rendering.
de_de: Keine gültigen Farben für das Rendering verfügbar.
es_es: No hay colores válidos disponibles para el renderizado.
fr_fr: Aucune couleur valide disponible pour le rendu.
it_it: Nessun colore valido disponibile per il rendering.
pt_br: Não há cores válidas disponíveis para renderização.

source: Unable to create temporary file for image.
de_de: Temporäre Datei für das Bild konnte nicht erstellt werden.
es_es: No se pudo crear el archivo temporal para la imagen.
fr_fr: Impossible de créer le fichier temporaire pour l'image.
it_it: Impossibile creare il file temporaneo per l'immagine.
pt_br: Não foi possível criar o arquivo temporário para a imagem.

source: Unable to write WebP image to temporary file.
de_de: WebP-Bild konnte nicht in die temporäre Datei geschrieben werden.
es_es: No se pudo escribir la imagen WebP en el archivo temporal.
fr_fr: Impossible d'écrire l'image WebP dans le fichier temporaire.
it_it: Impossibile scrivere l'immagine WebP nel file temporaneo.
pt_br: Não foi possível gravar a imagem WebP no arquivo temporário.

source: Image generation is unavailable. Please enable the GD extension with WebP support in your PHP environment.
de_de: Die Bilderzeugung ist nicht verfügbar. Bitte aktivieren Sie die GD-Erweiterung mit WebP-Unterstützung in Ihrer PHP-Umgebung.
es_es: La generación de imágenes no está disponible. Activa la extensión GD con soporte WebP en tu entorno PHP.
fr_fr: La génération d'images est indisponible. Veuillez activer l'extension GD avec la prise en charge WebP dans votre environnement PHP.
pt_br: A geração de imagens está indisponível. Ative a extensão GD com suporte a WebP no seu ambiente PHP.

source: Design Settings
de_de: Design-Einstellungen
es_es: Ajustes de diseño
fr_fr: Réglages de design
pt_br: Configurações de design

source: Optional comma-separated list of HEX colors. If provided, it overrides the selected palette.
de_de: Optionale, kommagetrennte Liste von HEX-Farben. Wenn angegeben, überschreibt sie die ausgewählte Palette.
es_es: Lista opcional de colores HEX separados por comas. Si se proporciona, reemplaza la paleta seleccionada.
fr_fr: Liste facultative de couleurs HEX séparées par des virgules. Si elle est fournie, elle remplace la palette sélectionnée.
pt_br: Lista opcional de cores HEX separadas por vírgula. Se informada, ela substitui a paleta selecionada.

source: Bulk Generation
de_de: Stapelgenerierung
es_es: Generación por lotes
fr_fr: Génération en lot
pt_br: Geração em lote
